---
kind: enumMember
id: F:Autodesk.Revit.DB.PropOverrideMode.ByEntity
enum: Autodesk.Revit.DB.PropOverrideMode
source: html/8d32fcba-032e-fd21-2b94-f115733fcbaa.htm
---
# Autodesk.Revit.DB.PropOverrideMode.ByEntity

Category properties BYLAYER, overrides BYENTITY.
 Entities generated by a specific category are assigned to a layer
 accordingly to the layer settings. To preserve visual fidelity,
 overridden attributes result in entity-specific attributes